{
  "backend/main.mo": "Defines dashboard types and an actor with CRUD operations on MonthlyDashboard records stored in a map, including sorting and year-based filtering.",
  "backend/migration.mo": "Transforms old dashboard records to the new format by mapping centers to centerName and initializing empty coaches arrays.",
  "feature_evidence.json": "Lists implemented features, associated files, components, and test IDs for charting, center name simplification, and coach center fields.",
  "frontend-file-summaries.txt": "Provides one-line summaries for all frontend source files and their roles in the dashboard application.",
  "frontend/index.css": "Empty stylesheet placeholder for global styles.",
  "frontend/index.html": "Basic HTML shell loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Wraps the DashboardPage in theme support and a notification toaster.",
  "frontend/src/components/dashboard/CenterComparisonChart.tsx": "Renders a grouped bar chart comparing revenue vs target per center for a selected month/year.",
  "frontend/src/components/dashboard/CoachesTableEditor.tsx": "Editable table for managing coaches with fields for name, center, and salary, supporting add/remove and validation.",
  "frontend/src/components/dashboard/DashboardHeader.tsx": "Displays the dashboard header with logo, title, and subtitle.",
  "frontend/src/components/dashboard/MetricsCards.tsx": "Shows four metric cards for revenue, target, total salaries, and salary output percentage.",
  "frontend/src/components/dashboard/MonthlyRecordEditor.tsx": "Interactive editor for monthly dashboard data with field validation, coach management, and save/delete actions.",
  "frontend/src/components/dashboard/MonthSelector.tsx": "Provides a styled month input for choosing the active dashboard month.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, loading stored identities and managing login/logout state.",
  "frontend/src/hooks/useMonthlyDashboards.ts": "React Query hooks to fetch, save, and delete monthly dashboard records via the backend actor.",
  "frontend/src/index.css": "Tailwind CSS setup defining light/dark theme variables and custom badminton-themed colors.",
  "frontend/src/lib/validation.ts": "Simple validation helpers for numbers, required fields, and YYYY-MM formatted months.",
  "frontend/src/main.tsx": "App entry point wiring React Query and Internet Identity provider around the root App component.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard page handling month selection, data loading, local editing, and save/delete operations for monthly records.",
  "frontend/tailwind.config.js": "Tailwind config enabling dark mode, custom colors, animations, and typography/plugins for the frontend UI.",
  "project_state.json": "JSON file defining project state, requirements, existing features, and architectural notes for the badminton dashboard."
}