{
  "kind": "build_request",
  "title": "Add selectable options for Center fields in the Monthly Record editor",
  "projectName": "Shuttle Dashboard",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-13",
      "text": "Add a selectable options UI for the \"Center Name\" field in the Monthly Record editor so users can pick from existing center names already saved in dashboards, while still allowing manual entry of a new center name.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "There should add option for all these"
        ]
      },
      "acceptanceCriteria": [
        "When dashboards are loaded, the Center Name input provides a list of unique, non-empty centerName values from existing saved monthly records.",
        "The Center Name field still supports typing a new value that is not in the list.",
        "Selecting an option updates the editor state the same way typing does (validation and save behavior remain correct)."
      ]
    },
    {
      "id": "REQ-14",
      "text": "Add a selectable options UI for the \"Center\" field in each coach row in the Coaches table editor so users can pick from existing center names already saved in dashboards, while still allowing manual entry of a new center name.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "There should add option for all these"
        ]
      },
      "acceptanceCriteria": [
        "Each coach row's Center field provides a list of unique, non-empty center names derived from existing saved monthly records (and should include the current record's centerName if present).",
        "The coach Center field still supports typing a new value that is not in the list.",
        "Selecting an option updates that coach row's center value and existing validation continues to work."
      ]
    },
    {
      "id": "REQ-15",
      "text": "Ensure the selectable options lists for Center Name and Coach Center automatically reflect newly saved or deleted records after React Query refreshes dashboard data.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "There should add option for all these"
        ]
      },
      "acceptanceCriteria": [
        "After saving a record with a new centerName, that center appears as an option for Center Name and Coach Center without a manual page refresh.",
        "After deleting the last record for a given centerName, the options list no longer includes that center name once data is refetched.",
        "No changes are required to backend APIs to support center options (derive options from the already-fetched getAllDashboards data)."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (compose existing UI components instead).",
    "Do not modify immutable hook files listed in SYSTEM_CONTEXT (useActor/useInternetIdentity/main.tsx, etc.).",
    "Keep backend as a single-actor Motoko canister; avoid schema changes unless strictly necessary."
  ],
  "nonGoals": [
    "Adding new backend endpoints solely for center options.",
    "Changing the monthly record storage keying strategy (year*100+month).",
    "Adding third-party integrations or external databases."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}