{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Selectable center options in Monthly Record and Coaches editors",
  "requirements": [
    {
      "id": "REQ-13",
      "summary": "Provide selectable Center Name options in the Monthly Record editor derived from existing saved dashboards while still allowing free text entry.",
      "acceptanceCriteria": [
        "When dashboards are loaded, the Center Name input provides a list of unique, non-empty centerName values from existing saved monthly records.",
        "The Center Name field still supports typing a new value that is not in the list.",
        "Selecting an option updates the editor state the same way typing does (validation and save behavior remain correct)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/DashboardPage.tsx",
          "operation": "modify",
          "description": "Derive a memoized list of unique, non-empty center names from the already-fetched dashboards data (and include the current editData.centerName when present) and pass it down as a prop for the MonthlyRecordEditor centerName options. Use existing shadcn-ui Input-based styling patterns in the consuming components; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/dashboard/MonthlyRecordEditor.tsx",
          "operation": "modify",
          "description": "Replace the plain Center Name input with an Input that supports selectable suggestions via a native datalist (or equivalent composition) while still allowing manual typing. Wire selection/typing through the existing handleCenterNameChange so validation and save behavior remain unchanged. Use existing shadcn-ui Input/Label components; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-14",
      "summary": "Provide selectable Center options in each coach row derived from existing saved dashboards while still allowing free text entry.",
      "acceptanceCriteria": [
        "Each coach row's Center field provides a list of unique, non-empty center names derived from existing saved monthly records (and should include the current record's centerName if present).",
        "The coach Center field still supports typing a new value that is not in the list.",
        "Selecting an option updates that coach row's center value and existing validation continues to work."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/DashboardPage.tsx",
          "operation": "modify",
          "description": "Pass the derived center options list down through MonthlyRecordEditor into CoachesTableEditor so each coach row can use the same set of suggestions (including current editData.centerName when present). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/dashboard/MonthlyRecordEditor.tsx",
          "operation": "modify",
          "description": "Extend CoachesTableEditor usage to provide center options for coach rows (prop drilling) while keeping the current onChange and errors wiring intact. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/dashboard/CoachesTableEditor.tsx",
          "operation": "modify",
          "description": "Update the coach Center cell to use an Input with selectable suggestions via a native datalist (or equivalent composition) backed by the provided center options list, while keeping free text entry and existing validation/error rendering unchanged. Use existing shadcn-ui Input/Table components; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-15",
      "summary": "Keep Center Name and Coach Center options automatically in sync with React Query refreshes after save/delete without backend changes.",
      "acceptanceCriteria": [
        "After saving a record with a new centerName, that center appears as an option for Center Name and Coach Center without a manual page refresh.",
        "After deleting the last record for a given centerName, the options list no longer includes that center name once data is refetched.",
        "No changes are required to backend APIs to support center options (derive options from the already-fetched getAllDashboards data)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/DashboardPage.tsx",
          "operation": "modify",
          "description": "Ensure center options are computed directly from the React Query dashboards result (useAllDashboards) via useMemo so invalidation/refetch after save/delete automatically updates the options list. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useMonthlyDashboards.ts",
          "operation": "modify",
          "description": "Confirm that dashboard save/delete mutations invalidate the dashboards query key used by useAllDashboards so refetches occur and the UI recomputes center options; adjust only if necessary while keeping behavior consistent. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}